test/data/xml/pelco/events/PullMessages.Request.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope 
  xmlns:s="http://www.w3.org/2003/05/soap-envelope" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" 
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
  xmlns:tt="http://www.onvif.org/ver10/schema" 
  xmlns:ter="http://www.onvif.org/ver10/error" 
  xmlns:tev="http://www.onvif.org/ver10/events/wsdl">
  <s:Header>
    <Action s:mustUnderstand="1">http://www.onvif.org/ver10/events/wsdl/PullPointSubscription/PullMessagesRequest</Action>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security s:mustUnderstand="1">
      <wsu:Timestamp wsu:Id="Time">
        <wsu:Created>1970-01-02T16:47:15.190Z</wsu:Created>
        <wsu:Expires>1970-01-02T16:47:25.190Z</wsu:Expires>
      </wsu:Timestamp>
      <wsse:UsernameToken wsu:Id="User">
        <wsse:Username>admin</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">Eo738NBxKRFQiOypZzBZaLqbuT0=</wsse:Password>
        <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">8x3k63KEuz0JlP/CzAPjBg==</wsse:Nonce>
        <wsu:Created 
          xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">1970-01-02T16:47:15.190Z
        </wsu:Created>
      </wsse:UsernameToken>
    </wsse:Security>
    <wsa:To s:mustUnderstand="1">http://10.10.1.66/onvif/eventing_service?id=urn:uuid:c495de08-9b85-870f-fe60-996acde54c12</wsa:To>
    <SubscriptionId s:mustUnderstand="1" s:IsReferenceParameter="1"
      xmlns="urn:schemas-pelco-com:ws:addressing:1">urn:uuid:c495de08-9b85-870f-fe60-996acde54c12
    </SubscriptionId>
  </s:Header>
  <s:Body>
    <tev:PullMessages>
      <tt:Timeout>2018-02-24T16:27:32.187Z</tt:Timeout>
      <tt:MessageLimit>99</tt:MessageLimit>
    </tev:PullMessages>
  </s:Body>
</s:Envelope>